/**
 * @file lib.h
 * @brief Заголовочний файл з описом функцій для генерації випадкових чисел та обчислення послідовності Фібоначчі.
 */

#include <stdio.h>
#include <stdlib.h>
#include <time.h>

/**
 * @brief Генерує випадкове число за допомогою функції rand().
 *
 * Функція генерує випадкове число, використовуючи стандартну функцію rand().
 *
 * @return int Згенероване випадкове число.
 */
int grandom();

/**
 * @brief Повертає поточний час у секундах.
 *
 * Функція повертає поточний час в секундах, використовуючи функцію time().
 *
 * @return int Поточний час у секундах.
 */
int gtime();

/**
 * @brief Знаходить послідовність Фібоначчі та виводить її на екран.
 *
 * Функція генерує випадкове число, створює масив чисел Фібоначчі, менших за задане випадкове число,
 * та виводить їх на екран.
 *
 * @return int Код завершення програми.
 */
int findFibonachi();