#include <stdio.h>
int main()
{
	int xxx, yyy, zzz, ccc, iii; //Вводимо змінні
	int arr[10]; //Вводимо масив, який складається з 10 цілих чисел

	while (1) {
		xxx = 0; //Задаємо  початкові значення змінних
		yyy = 1;
		ccc = 0;
		do { // Початок виконання цикла
			arr[ccc] = xxx; //Записуємо в 0 елемент масива число, а потім дії продовжуються
			ccc += 1; //з кожним повторенням цикла елемент масива буде збільшуватися на 1
			zzz = xxx + yyy; //В цій дії буде обчислюватися кожен раз число Фібоначчі
			xxx = yyy; //А в цих діях число записується для обчислення наступного числа Фібоначчі
			yyy = zzz;
		} while (xxx < 35); //Цикл продовжується до тих пір поки число Фібоначі не буде перевищувати 35
		for (iii = 0; iii < 10; iii++) { //За допомогою цикла for виводимо на екран всі чмсла які записані до масива arr
			printf(" %d", arr[iii]); // Числа в масиві виводяться послідовно з 0 елемента до 9 через пробєл
		}
		return 0;
	}
}
