/**
 * @file lib.h
 * @brief Файл містить оголошення функцій для обробки тексту та знаходження найдовшого та найкоротшого слова.
 */
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#define MAX_LENGTH 1000

/**
 * @brief Знаходить найдовше та найкоротше слово в рядку тексту.
 *
 * Функція приймає рядок тексту `text` і знаходить найдовше та найкоротше слово.
 * Результат виводиться на екран.
 *
 * @param text Рядок тексту для обробки.
 */
void find_longest_shortest_word(char* text);

/**
 * @brief Обробляє текст та знаходить найдовше та найкоротше слово.
 *
 * Функція виконує обробку тексту, зчитаного з файлу "assets/input.txt".
 * Викликає функцію find_longest_shortest_word для знаходження найдовшого та найкоротшого слова.
 * Результат виводиться на екран.
 *
 * @return 0 у разі успішного виконання, 1 у разі помилки.
 */
int text();


