/**
 * @file lib.h
 * @brief Заголовочний файл з прототипами функцій для модуля lib.
 */

#include <stdio.h>
#include <stdlib.h>
#include <time.h>

/**
 * @brief Обчислює комбінаційний коефіцієнт C(n, k).
 *
 * Функція обчислює комбінаційний коефіцієнт C(n, k), де n та k - цілі числа.
 *
 * @param n Ціле число, число елементів.
 * @param k Ціле число, кількість вибраних елементів.
 * @return Значення комбінаційного коефіцієнту C(n, k).
 */
int binomialCoefficient(int n, int k);

/**
 * @brief Формує трикутник Паскаля ітеративним методом.
 *
 * Функція формує трикутник Паскаля розміром n і виводить його на екран.
 *
 * @param n Ціле число, розмір трикутника Паскаля.
 */
void pascalTriangleIterative(int n);

/**
 * @brief Формує трикутник Паскаля рекурсивним методом.
 *
 * Функція формує трикутник Паскаля розміром n і виводить його на екран.
 *
 * @param n Ціле число, розмір трикутника Паскаля.
 */
void pascalTriangleRecursive(int n);


