/**
 * @file main.c
 * @brief Головний файл програми
 */

#include "lib.h"

/**
 * @brief Функція main - точка входу в програму
 * 
 * У цій функції користувачу пропонується ввести кількість рядків для трикутника Паскаля.
 * Потім викликаються функції pascalTriangleIterative() і pascalTriangleRecursive(),
 * які генерують та виводять на екран трикутник Паскаля за допомогою ітеративного та рекурсивного методів відповідно.
 * 
 * @return 0 у разі успішного виконання програми
 */
int main() {
    int n;

    printf("Введіть кількість рядків для трикутника Паскаля: ");
    scanf("%d", &n);

    printf("\nІтеративний трикутник Паскаля:\n");
    pascalTriangleIterative(n);

    printf("\nРекурсивний трикутник Паскаля:\n");
    pascalTriangleRecursive(n);

    return 0;
}
