#include <stdio.h>
int main()
{
	int xxx = 1986; // Змінна, в яку ми вписуємо придумане число
	int yyy = xxx / 100; //Ввідділяємо ліву частину числа
	int zzz = xxx % 100; // Відділяємо праву частину числа
	int aaa = yyy + 1; //Якщо число перебільшує праву частину то століття буде дорівнювати на 1 більше, томму нам і потрібна ця змінна
	if (zzz == 0) { //Якщо остача від ділення на 100 дорівнює 0
		printf("Століття = %d", yyy); //то виводимо на екран століття
	} else if (zzz > 0) { //Якщо остача від ділення на 100 більше 0
		printf("Століття = %d", aaa); //То виводимо на екран число яке більше від правої частини на 1, тобто століття
	}

	return 0;
}
