/**
 * @file lib.h
 * @brief Заголовочний файл з прототипами функцій для роботи з матрицями.
 */

#include <stdio.h>
#include <stdlib.h>
#include <time.h>
#include "check.h"


/**
 * @brief Сортує елементи головної діагоналі матриці за зростанням.
 *
 * Функція отримує матрицю, її розмір та масив, в який будуть записані відсортовані елементи головної діагоналі.
 * Спочатку вона отримує всі елементи головної діагоналі та зберігає їх у тимчасовий масив.
 * Потім сортує елементи за зростанням та копіює їх в результатовий масив.
 *
 * @param matrix Двовимірний масив, що представляє матрицю.
 * @param N Розмір матриці (кількість рядків або стовпців).
 * @param result Масив, в який будуть записані відсортовані елементи головної діагоналі.
 */
void sort(int** matrix, int N, int* result);

/**
 * @brief Функція для генерації матриці та сортування елементів головної діагоналі.
 *
 * Функція запитує у користувача розмір матриці, виділяє пам'ять для матриці та результату,
 * заповнює матрицю випадковими числами, викликає функцію sort() та виводить результат.
 *
 * @return Код успішного виконання функції.
 */
int matrix();


