/**
 * @file lib.h
 * @brief Оголошення функцій для роботи з трикутником
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

/**
 * @brief Створює порожній рівнобедрений трикутник у вихідному файлі
 * 
 * Функція створює порожній рівнобедрений трикутник у вихідному файлі з заданою висотою, 
 * символом заповнювача та шириною основи.
 * 
 * @param input_filename Ім'я вхідного файлу, який містить параметри трикутника
 * @param output_filename Ім'я вихідного файлу, у якому буде збережений результат
 */
void create_triangle(const char* input_filename, const char* output_filename);

/**
 * @brief Основна функція для роботи з трикутником
 * 
 * Функція `triagle` є вхідним точкою програми та здійснює обробку аргументів командного рядка.
 * Вона викликає функцію `create_triangle` з переданими іменами вхідного та вихідного файлів.
 * 
 * @param argc Кількість аргументів командного рядка
 * @param argv Масив аргументів командного рядка
 * @return Код завершення програми
 */
int triagle(int argc, char* argv[]);

